cf/DocumentJournals/CashDocuments.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DocumentJournal>
		<Properties>
			<Name>CashDocuments</Name>
			<RegisteredDocuments>
				<xr:Item>Document.CashPayment</xr:Item>
				<xr:Item>Document.CashReceipt</xr:Item>
			</RegisteredDocuments>
		</Properties>
		<ChildObjects>
			<Column>
				<Properties>
					<Name>Company</Name>
					<References>
						<xr:Item>Document.CashPayment.Attribute.Company</xr:Item>
						<xr:Item>Document.CashReceipt.Attribute.Company</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>OperationKind</Name>
					<References>
						<xr:Item>Document.CashPayment.Attribute.OperationKind</xr:Item>
						<xr:Item>Document.CashReceipt.Attribute.OperationKind</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>PettyCash</Name>
					<References>
						<xr:Item>Document.CashPayment.Attribute.PettyCash</xr:Item>
						<xr:Item>Document.CashReceipt.Attribute.PettyCash</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Item</Name>
					<References>
						<xr:Item>Document.CashPayment.Attribute.Item</xr:Item>
						<xr:Item>Document.CashReceipt.Attribute.Item</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>AcceptedFrom</Name>
					<References>
						<xr:Item>Document.CashReceipt.Attribute.AcceptedFrom</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Counterparty</Name>
					<References>
						<xr:Item>Document.CashPayment.Attribute.Counterparty</xr:Item>
						<xr:Item>Document.CashReceipt.Attribute.Counterparty</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>AdvanceHolder</Name>
					<References>
						<xr:Item>Document.CashReceipt.Attribute.AdvanceHolder</xr:Item>
						<xr:Item>Document.CashPayment.Attribute.AdvanceHolder</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>AmountReceipt</Name>
					<References>
						<xr:Item>Document.CashReceipt.Attribute.DocumentAmount</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>AmountExpense</Name>
					<References>
						<xr:Item>Document.CashPayment.Attribute.DocumentAmount</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Currency</Name>
					<References>
						<xr:Item>Document.CashPayment.Attribute.CashCurrency</xr:Item>
						<xr:Item>Document.CashReceipt.Attribute.CashCurrency</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Comment</Name>
					<References>
						<xr:Item>Document.CashPayment.Attribute.Comment</xr:Item>
						<xr:Item>Document.CashReceipt.Attribute.Comment</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>CashCR</Name>
					<References>
						<xr:Item>Document.CashReceipt.Attribute.CashCR</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>StructuralUnit</Name>
					<References>
						<xr:Item>Document.CashReceipt.Attribute.StructuralUnit</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Correspondence</Name>
					<References>
						<xr:Item>Document.CashReceipt.Attribute.Correspondence</xr:Item>
						<xr:Item>Document.CashPayment.Attribute.Correspondence</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Author</Name>
					<References>
						<xr:Item>Document.CashReceipt.Attribute.Author</xr:Item>
						<xr:Item>Document.CashPayment.Attribute.Author</xr:Item>
					</References>
				</Properties>
			</Column>
		</ChildObjects>
	</DocumentJournal>
</MetaDataObject>

cf/AccumulationRegisters/CashAssets.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<AccumulationRegister>
		<Properties>
			<Name>CashAssets</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AmountCur</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ContentOfAccountingRecord</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Item</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CashFlowItems</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>CashAssetsType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CashAssetTypes</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>BankAccountPettyCash</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BankAccounts</v8:Type>
						<v8:Type>cfg:CatalogRef.PettyCashes</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/DocumentJournals/CashDocuments/Forms/ListForm/Ext/Form/Module.bsl
#Region HelperProceduresAndFunctions

&AtServerNoContext
Function GetDataByPettyCash(Period, PettyCash, Currency)
	
	Query = New Query;
	Query.Text =
	"SELECT
	|	CashAssetsBalanceAndTurnovers.AmountCurOpeningBalance AS InformationAmountCurOpeningBalance,
	|	CashAssetsBalanceAndTurnovers.AmountCurReceipt AS InformationAmountCurReceipt,
	|	CashAssetsBalanceAndTurnovers.AmountCurExpense AS InformationAmountCurExpense,
	|	CashAssetsBalanceAndTurnovers.AmountCurClosingBalance AS InformationAmountCurClosingBalance
	|FROM
	|	AccumulationRegister.CashAssets.BalanceAndTurnovers(
	|			&BeginOfPeriod,
	|			&EndOfPeriod,
	|			Day,
	|			,
	|			BankAccountPettyCash = &PettyCash
	|				AND Currency = &Currency) AS CashAssetsBalanceAndTurnovers";
	
	Query.SetParameter("BeginOfPeriod", BegOfDay(Period));
	Query.SetParameter("EndOfPeriod", EndOfDay(Period));
	Query.SetParameter("PettyCash", PettyCash);
	Query.SetParameter("Currency", ?(ValueIsFilled(Currency), Currency, Constants.NationalCurrency.Get()));
	ResultSelection = Query.Execute().Select();
	
	If ResultSelection.Next() Then
		ReturnStructure = New Structure("InformationAmountCurOpeningBalance, InformationAmountCurClosingBalance, InformationAmountCurReceipt, InformationAmountCurExpense, CurrencyTransactionsAccounting");
		FillPropertyValues(ReturnStructure, ResultSelection);
		ReturnStructure.CurrencyTransactionsAccounting = GetFunctionalOption("CurrencyTransactionsAccounting");
		Return ReturnStructure;
	Else
		Return New Structure(
			"InformationAmountCurClosingBalance, InformationAmountCurOpeningBalance, InformationAmountCurReceipt, InformationAmountCurExpense, CurrencyTransactionsAccounting",
			0,0,0,0,False
		);
	EndIf;
	
EndFunction // GetDataByBankAccount()

&AtClient
Procedure Attachable_HandleListRowActivation()
	
	CurrentRow = Items.CashDocuments.CurrentData;
	If CurrentRow <> Undefined Then
		StructureData = GetDataByPettyCash(CurrentRow.Date, CurrentRow.PettyCash, CurrentRow.Currency);
		FillPropertyValues(ThisForm, StructureData);
		Date = Format(CurrentRow.Date, "DLF=D");
		If StructureData.CurrencyTransactionsAccounting Then
			Date = Date + " (" + CurrentRow.Currency + ")";
		EndIf;
	Else
		InformationAmountCurClosingBalance = 0;
		InformationAmountCurOpeningBalance = 0;
		InformationAmountCurReceipt = 0;
		InformationAmountCurExpense = 0;
		Date = "";
	EndIf;
	
EndProcedure // HandleListStringActivation()

#EndRegion

#Region EventsHandlers

&AtServer
Procedure BeforeLoadDataFromSettingsAtServer(Settings)
	
	Company	 = Settings.Get("Company");
	Counterparty	 = Settings.Get("Counterparty");
	PettyCash		 = Settings.Get("PettyCash");
	
	SmallBusinessClientServer.SetListFilterItem(CashDocuments, "CompanyForFiltering", Company, ValueIsFilled(Company));
	SmallBusinessClientServer.SetListFilterItem(CashDocuments, "Counterparty", Counterparty, ValueIsFilled(Counterparty));
	SmallBusinessClientServer.SetListFilterItem(CashDocuments, "PettyCash", PettyCash, ValueIsFilled(PettyCash));
	
EndProcedure // OnLoadDataFromSettingsAtServer()

&AtClient
Procedure PettyCashOnChange(Item)
	
	SmallBusinessClientServer.SetListFilterItem(CashDocuments, "PettyCash", PettyCash, ValueIsFilled(PettyCash));
	
EndProcedure

&AtClient
Procedure CounterpartyOnChange(Item)
	
	SmallBusinessClientServer.SetListFilterItem(CashDocuments, "Counterparty", Counterparty, ValueIsFilled(Counterparty));
	
EndProcedure

&AtClient
Procedure CompanyOnChange(Item)
	
	SmallBusinessClientServer.SetListFilterItem(CashDocuments, "CompanyForFiltering", Company, ValueIsFilled(Company));
	
EndProcedure

&AtClient
Procedure CashDocumentsOnActivateRow(Item)
	
	AttachIdleHandler("Attachable_HandleListRowActivation", 0.2, True);
	
EndProcedure // PettyCashDocumentsOnActivateRow()

&AtClient
Procedure NotificationProcessing(EventName, Parameter, Source)
	
	If EventName = "NotificationAboutChangingDebt" Then
		Attachable_HandleListRowActivation();
	EndIf;
	
EndProcedure // NotificationProcessing()

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	// Set the format for the current date: DF=H:mm
	SmallBusinessServer.SetDesignDateColumn(CashDocuments);
	
EndProcedure

&AtClient
Procedure StatementGoTo(Command)
	
	OpenForm("Report.CashAssets.Form", New Structure("VariantKey", "Statement"));
	
EndProcedure // StatementGoTo()

#EndRegion
